create_clock -period 6.500 -name clk -waveform {0.000 3.250} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.100 [get_ports {cpu_addr[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports {cpu_addr[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.100 [get_ports {cpu_data_in[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports {cpu_data_in[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.100 [get_ports {mem_acc_data[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports {mem_acc_data[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.100 [get_ports cpu_write]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports cpu_write]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.100 [get_ports reset]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports reset]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.900 [get_ports {cpu_data_out[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports {cpu_data_out[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.900 [get_ports {mem_acc_address[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports {mem_acc_address[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.900 [get_ports {mem_acc_data[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports {mem_acc_data[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.900 [get_ports cpu_acc_busy]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports cpu_acc_busy]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.900 [get_ports mem_acc_read]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports mem_acc_read]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.900 [get_ports mem_acc_write]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports mem_acc_write]
create_clock -period 6.500 -name virtual_clock -waveform {0.000 3.250}
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports cpu_read]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports cpu_read]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[0]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[0]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[1]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[1]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[2]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[2]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[3]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[3]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[4]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[4]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[5]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[5]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[6]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[6]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[7]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[7]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[8]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[8]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[9]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[9]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[10]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[10]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[11]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[11]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[12]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[12]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[13]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[13]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[14]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[14]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[15]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[15]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[16]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[16]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[17]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[17]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[18]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[18]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[19]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[19]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[20]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[20]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[21]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[21]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[22]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[22]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[23]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[23]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[24]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[24]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[25]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[25]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[26]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[26]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[27]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[27]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[28]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[28]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[29]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[29]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[30]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[30]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 0.100 [get_ports {cpu_data_out[31]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 1.000 [get_ports {cpu_data_out[31]}]
set_false_path -from [get_clocks *clk*]
